#### ScheduleHeightsOnSheet Members

---

|  |
| --- |
| ScheduleHeightsOnSheet Class   Methods   Properties   See Also |

The  ScheduleHeightsOnSheet  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ScheduleHeightsOnSheet |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBodyRowHeights | Returns each row's height of schedule body on sheet view. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ColumnHeaderHeight | The height of all schedule header part, including the gap line between header and body. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | TitleHeight | The height of schedule title on sheet view. |

# See Also

ScheduleHeightsOnSheet Class

Autodesk.Revit.DB Namespace